# Вывести квадрат числа

number=int(input('Введите число '))
print('Квадрат числа {} равен {}'.format(number, number**2))
print(f'Квадрат числа {number} равен { number**2 }')
print('Квадрат числа', number, 'равен', number**2)