# Напишите программу, которая будет принимать на вход дробь и показывать первую цифру дробной части
a = float(input("A="))
n=int(a*10%10)
print(n)